package ru.foxit.grayfox;

public class Encapsulation {
    // Инкапсуляция - это сокрытие реализации, то есть мы отправляем какие то параметры на вход в метод, мы
    // не знаем, что внутри происходит, мы просто получаем обратно уже готовую информацию.
    // А что происходит внутри, это не важно! Так обычно вы будете использовать большинство классов, написанные
    // другими разработчиками (классов и библиотек), не особо разбираясь, как они там внутри работает.
    // Просто прочитав, что данная библиотека сжимает на 30 процентов, вы будете подключать к своему
    // проекту и давать ей картинку в виде бинарного потока, а на выходе получать готовый файлик
    // на 30% меньше и Вас не волнует, что там происходит с этой картинкой.
    // Вы должны руководствоваться тем, что Пользователь должен иметь доступ только к открытой
    // информации файла.
}
